app/controllers/author_controller.rb

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def create
  nb= rand(1..10)
  @user = User.create(first_name: params[:first_name], last_name: params[:last_name], description: params[:description], age: params[:age], email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation], city_id: nb )