app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a mofif"], ["content", "blablabla à modifier pour l test "], ["user_id", 13], ["created_at", "2019-10-31 15:30:12.054189"], ["updated_at", "2019-10-31 15:30:12.054189"]]
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaircite de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)

  @gossip = Gossip.create(title: params[:title], content: params[:content], user_id: session[:user_id]) # avec xxx qui sont les données obtenues à partir du formulaire

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    # Méthode qui récupère le potin concerné et l'envoie à la view edit (edit.html.erb) pour affichage dans un formulaire d'édition
  @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "NOUVEAU"], ["content", "INch inch ce potin sera modifié "], ["updated_at", "2019-10-31 15:36:55.947952"], ["id", 10]]
---
  def update

     @gossip = Gossip.find(params[:id])
     post_params = params.permit(:title, :content)

  unless compare_user(session[:user_id], @gossip.user_id) == false
     if @gossip.update(title: params[:title], content: params[:content])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 6]]
---
  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)


    @gossip = Gossip.find(params[:id])

   unless compare_user(session[:user_id], @gossip.user_id) == false
      if  @gossip.destroy